[Killed] LogicalOperator
src/engine/v5/loop2.ts:23:68
 /** Working sets only. `isApproach` marks LEGACY Build-#33 approach sets (Rev 8 deleted the
  *  mechanism; nothing writes the mark any more) — they stay excluded so those histories never
  *  pollute a decision. */
-const working = (sets: SetPerf[]): SetPerf[] => sets.filter((s) => !s.isApproach && s.reps >= 0);
+const working = (sets: SetPerf[]): SetPerf[] => sets.filter((s) => !s.isApproach || s.reps >= 0);
 
 /** Did the set meet the target (reps ≥ Tlo, and it was really performed)? */
killedBy: S-16 · an ambiguous session (no usable working set) holds the load approach sets are excluded from the decision (S-60)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ambiguous"
Received: "progress"

[Killed] ArrowFunction
src/engine/v5/loop2.ts:23:17
 /** Working sets only. `isApproach` marks LEGACY Build-#33 approach sets (Rev 8 deleted the
  *  mechanism; nothing writes the mark any more) — they stay excluded so those histories never
  *  pollute a decision. */
-const working = (sets: SetPerf[]): SetPerf[] => sets.filter((s) => !s.isApproach && s.reps >= 0);
+const working = () => undefined;
 
 /** Did the set meet the target (reps ≥ Tlo, and it was really performed)? */
killedBy: S-22 · all working sets met Tlo → the load goes up progress, and the athlete never has to reach the top of the band
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] EqualityOperator
src/engine/v5/loop2.ts:26:74
 const working = (sets: SetPerf[]): SetPerf[] => sets.filter((s) => !s.isApproach && s.reps >= 0);
 
 /** Did the set meet the target (reps ≥ Tlo, and it was really performed)? */
-const metTlo = (s: SetPerf, band: Band): boolean => s.reps >= band.lo && s.reps > 0;
+const metTlo = (s: SetPerf, band: Band): boolean => s.reps >= band.lo && s.reps <= 0;
 
 /**
killedBy: Stage 5 · the façade drives the prescription from exercise-keyed state S-22 · a full-clear workout advances the load PER WORKOUT (not at Saturday — L7)
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 60
Received:   60

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:26:53
 const working = (sets: SetPerf[]): SetPerf[] => sets.filter((s) => !s.isApproach && s.reps >= 0);
 
 /** Did the set meet the target (reps ≥ Tlo, and it was really performed)? */
-const metTlo = (s: SetPerf, band: Band): boolean => s.reps >= band.lo && s.reps > 0;
+const metTlo = (s: SetPerf, band: Band): boolean => false;
 
 /**
killedBy: S-22 · all working sets met Tlo → the load goes up progress, and the athlete never has to reach the top of the band
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: "stall_backoff"

[Killed] BlockStatement
src/engine/v5/loop2.ts:36:101
  * first response is always to back off and re-climb. History is newest-first; only the recency window
  * counts (an old plateau is not "her today"). Bodyweight has no load axis → never a rotate signal.
  */
-function isRepeatedStall(history: SessionRecord[], currentLoad: number | null, band: Band): boolean {
-  if (currentLoad == null) return false;
-  const stalledHere = (rec: SessionRecord): boolean =>
-    rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
-  let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
-  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    if (rec.load != null && rec.load < currentLoad - EPS) sawBackoff = true;
-    if (sawBackoff && stalledHere(rec)) return true;
-  }
-  return false;
-}
+function isRepeatedStall(history: SessionRecord[], currentLoad: number | null, band: Band): boolean {}
 
 // ── The rail (L11) ─────────────────────────────────────────────────────────
killedBy: S-25 · a stall backs off, then rotates a REPEATED stall at the same wall (stall → back off → re-climb → stall again) rotates (S-25.2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:37:7
  * counts (an old plateau is not "her today"). Bodyweight has no load axis → never a rotate signal.
  */
 function isRepeatedStall(history: SessionRecord[], currentLoad: number | null, band: Band): boolean {
-  if (currentLoad == null) return false;
+  if (true) return false;
   const stalledHere = (rec: SessionRecord): boolean =>
     rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
killedBy: S-25 · a stall backs off, then rotates a REPEATED stall at the same wall (stall → back off → re-climb → stall again) rotates (S-25.2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:37:7
  * counts (an old plateau is not "her today"). Bodyweight has no load axis → never a rotate signal.
  */
 function isRepeatedStall(history: SessionRecord[], currentLoad: number | null, band: Band): boolean {
-  if (currentLoad == null) return false;
+  if (currentLoad != null) return false;
   const stalledHere = (rec: SessionRecord): boolean =>
     rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
killedBy: S-25.2 · the same wall twice, with a rebuild between back off, re-climb, hit it again → the engine asks to rotate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] ArrowFunction
src/engine/v5/loop2.ts:38:23
  */
 function isRepeatedStall(history: SessionRecord[], currentLoad: number | null, band: Band): boolean {
   if (currentLoad == null) return false;
-  const stalledHere = (rec: SessionRecord): boolean =>
-    rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
+  const stalledHere = () => undefined;
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
killedBy: S-25.2 · the same wall twice, with a rebuild between back off, re-climb, hit it again → the engine asks to rotate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:39:5
 function isRepeatedStall(history: SessionRecord[], currentLoad: number | null, band: Band): boolean {
   if (currentLoad == null) return false;
   const stalledHere = (rec: SessionRecord): boolean =>
-    rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
+    false;
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
killedBy: S-25 · a stall backs off, then rotates a REPEATED stall at the same wall (stall → back off → re-climb → stall again) rotates (S-25.2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] BooleanLiteral
src/engine/v5/loop2.ts:39:90
 function isRepeatedStall(history: SessionRecord[], currentLoad: number | null, band: Band): boolean {
   if (currentLoad == null) return false;
   const stalledHere = (rec: SessionRecord): boolean =>
-    rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
+    rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && rec.sets.every(s => metTlo(s, band));
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
killedBy: S-25 · a stall backs off, then rotates a REPEATED stall at the same wall (stall → back off → re-climb → stall again) rotates (S-25.2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] BooleanLiteral
src/engine/v5/loop2.ts:40:20
   if (currentLoad == null) return false;
   const stalledHere = (rec: SessionRecord): boolean =>
     rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
-  let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
+  let sawBackoff = true; // walking newest → oldest, a back-off is more recent than the earlier stall
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     if (rec.load != null && rec.load < currentLoad - EPS) sawBackoff = true;
killedBy: S-25 · a stall backs off, then rotates a FIRST stall backs off even with rotation available (S-25 order — back off before rotate)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_backoff"
Received: "stall_rotate"

[Killed] BlockStatement
src/engine/v5/loop2.ts:41:64
   const stalledHere = (rec: SessionRecord): boolean =>
     rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
-  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    if (rec.load != null && rec.load < currentLoad - EPS) sawBackoff = true;
-    if (sawBackoff && stalledHere(rec)) return true;
-  }
+  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {}
   return false;
 }
killedBy: S-25 · a stall backs off, then rotates a REPEATED stall at the same wall (stall → back off → re-climb → stall again) rotates (S-25.2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Survived] MethodExpression
src/engine/v5/loop2.ts:41:21
   const stalledHere = (rec: SessionRecord): boolean =>
     rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
-  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
+  for (const rec of history) {
     if (rec.load != null && rec.load < currentLoad - EPS) sawBackoff = true;
     if (sawBackoff && stalledHere(rec)) return true;

[Killed] ArithmeticOperator
src/engine/v5/loop2.ts:42:40
     rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    if (rec.load != null && rec.load < currentLoad - EPS) sawBackoff = true;
+    if (rec.load != null && rec.load < currentLoad + EPS) sawBackoff = true;
     if (sawBackoff && stalledHere(rec)) return true;
   }
killedBy: 10 weeks of real training, on the real seam man 80 kg · 4 days keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "shortOfTarget": StringMatching /^(\d|1\d|2[0-4])\.\d%$/,
+   "shortOfTarget": "25.4%",

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:42:29
     rec.load != null && Math.abs(rec.load - currentLoad) < EPS && rec.sets.length > 0 && !rec.sets.every((s) => metTlo(s, band));
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    if (rec.load != null && rec.load < currentLoad - EPS) sawBackoff = true;
+    if (rec.load != null && true) sawBackoff = true;
     if (sawBackoff && stalledHere(rec)) return true;
   }
killedBy: S-25 · a stall backs off, then rotates a FIRST stall backs off even with rotation available (S-25 order — back off before rotate)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_backoff"
Received: "stall_rotate"

[Killed] BooleanLiteral
src/engine/v5/loop2.ts:43:48
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     if (rec.load != null && rec.load < currentLoad - EPS) sawBackoff = true;
-    if (sawBackoff && stalledHere(rec)) return true;
+    if (sawBackoff && stalledHere(rec)) return false;
   }
   return false;
killedBy: S-25 · a stall backs off, then rotates a REPEATED stall at the same wall (stall → back off → re-climb → stall again) rotates (S-25.2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:43:9
   let sawBackoff = false; // walking newest → oldest, a back-off is more recent than the earlier stall
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     if (rec.load != null && rec.load < currentLoad - EPS) sawBackoff = true;
-    if (sawBackoff && stalledHere(rec)) return true;
+    if (false) return true;
   }
   return false;
killedBy: S-25 · a stall backs off, then rotates a REPEATED stall at the same wall (stall → back off → re-climb → stall again) rotates (S-25.2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Survived] BlockStatement
src/engine/v5/loop2.ts:56:74
  * first set, plus the athlete's own eyes on a visible number (S-49). Never reads the current
  * session, so a fat-finger cannot lift its own ceiling.
  */
-function railRecord(history: SessionRecord[], band: Band): number | null {
-  let best: number | null = null;
-  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    for (const s of rec.sets) {
-      if (s.isApproach || s.load == null) continue;
-      if (s.reps >= band.lo && (best == null || s.load > best)) best = s.load;
-    }
-  }
-  return best;
-}
+function railRecord(history: SessionRecord[], band: Band): number | null {}
 
 /**

[Survived] BlockStatement
src/engine/v5/loop2.ts:58:64
  */
 function railRecord(history: SessionRecord[], band: Band): number | null {
   let best: number | null = null;
-  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    for (const s of rec.sets) {
-      if (s.isApproach || s.load == null) continue;
-      if (s.reps >= band.lo && (best == null || s.load > best)) best = s.load;
-    }
-  }
+  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {}
   return best;
 }

[Survived] MethodExpression
src/engine/v5/loop2.ts:58:21
  */
 function railRecord(history: SessionRecord[], band: Band): number | null {
   let best: number | null = null;
-  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
+  for (const rec of history) {
     for (const s of rec.sets) {
       if (s.isApproach || s.load == null) continue;

[Survived] BlockStatement
src/engine/v5/loop2.ts:59:31
 function railRecord(history: SessionRecord[], band: Band): number | null {
   let best: number | null = null;
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    for (const s of rec.sets) {
-      if (s.isApproach || s.load == null) continue;
-      if (s.reps >= band.lo && (best == null || s.load > best)) best = s.load;
-    }
+    for (const s of rec.sets) {}
   }
   return best;

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:60:11
   let best: number | null = null;
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     for (const s of rec.sets) {
-      if (s.isApproach || s.load == null) continue;
+      if (false) continue;
       if (s.reps >= band.lo && (best == null || s.load > best)) best = s.load;
     }

[Survived] EqualityOperator
src/engine/v5/loop2.ts:60:27
   let best: number | null = null;
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     for (const s of rec.sets) {
-      if (s.isApproach || s.load == null) continue;
+      if (s.isApproach || s.load != null) continue;
       if (s.reps >= band.lo && (best == null || s.load > best)) best = s.load;
     }

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:61:33
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     for (const s of rec.sets) {
       if (s.isApproach || s.load == null) continue;
-      if (s.reps >= band.lo && (best == null || s.load > best)) best = s.load;
+      if (s.reps >= band.lo && (true)) best = s.load;
     }
   }

[Survived] EqualityOperator
src/engine/v5/loop2.ts:61:33
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     for (const s of rec.sets) {
       if (s.isApproach || s.load == null) continue;
-      if (s.reps >= band.lo && (best == null || s.load > best)) best = s.load;
+      if (s.reps >= band.lo && (best != null || s.load > best)) best = s.load;
     }
   }

[Killed] BlockStatement
src/engine/v5/loop2.ts:76:123
  * Inactive (no settled record AND no anchor) → unchanged; on a never-done lift Loop 1 and her own
  * eyes are the guard (L11 / S-49 — no ceiling is invented for that moment).
  */
-function applyRail(load: number, history: SessionRecord[], band: Band, meta: ExerciseMeta, anchor: number | null): number {
-  const rec = railRecord(history, band);
-  const base = rec == null ? anchor : anchor == null ? rec : Math.max(rec, anchor);
-  if (base == null) return load;
-  const ceil = nextRung(base, meta.equipment, meta.observedLoads);
-  return load > ceil + EPS ? ceil : load;
-}
+function applyRail(load: number, history: SessionRecord[], band: Band, meta: ExerciseMeta, anchor: number | null): number {}
 
 // ── The stall read (S-25) ──────────────────────────────────────────────────
killedBy: 10 weeks of real training, on the real seam woman 58 kg · 3 days keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 100
Received:   93

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:78:39
  */
 function applyRail(load: number, history: SessionRecord[], band: Band, meta: ExerciseMeta, anchor: number | null): number {
   const rec = railRecord(history, band);
-  const base = rec == null ? anchor : anchor == null ? rec : Math.max(rec, anchor);
+  const base = rec == null ? anchor : true ? rec : Math.max(rec, anchor);
   if (base == null) return load;
   const ceil = nextRung(base, meta.equipment, meta.observedLoads);
killedBy: the stamp keeps two workouts apart Monday's decision is never reported as Thursday's
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] MethodExpression
src/engine/v5/loop2.ts:78:62
  */
 function applyRail(load: number, history: SessionRecord[], band: Band, meta: ExerciseMeta, anchor: number | null): number {
   const rec = railRecord(history, band);
-  const base = rec == null ? anchor : anchor == null ? rec : Math.max(rec, anchor);
+  const base = rec == null ? anchor : anchor == null ? rec : Math.min(rec, anchor);
   if (base == null) return load;
   const ceil = nextRung(base, meta.equipment, meta.observedLoads);
killedBy: the stamp keeps two workouts apart Monday's decision is never reported as Thursday's
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] EqualityOperator
src/engine/v5/loop2.ts:79:7
 function applyRail(load: number, history: SessionRecord[], band: Band, meta: ExerciseMeta, anchor: number | null): number {
   const rec = railRecord(history, band);
   const base = rec == null ? anchor : anchor == null ? rec : Math.max(rec, anchor);
-  if (base == null) return load;
+  if (base != null) return load;
   const ceil = nextRung(base, meta.equipment, meta.observedLoads);
   return load > ceil + EPS ? ceil : load;

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:79:7
 function applyRail(load: number, history: SessionRecord[], band: Band, meta: ExerciseMeta, anchor: number | null): number {
   const rec = railRecord(history, band);
   const base = rec == null ? anchor : anchor == null ? rec : Math.max(rec, anchor);
-  if (base == null) return load;
+  if (true) return load;
   const ceil = nextRung(base, meta.equipment, meta.observedLoads);
   return load > ceil + EPS ? ceil : load;

[Killed] EqualityOperator
src/engine/v5/loop2.ts:81:10
   const base = rec == null ? anchor : anchor == null ? rec : Math.max(rec, anchor);
   if (base == null) return load;
   const ceil = nextRung(base, meta.equipment, meta.observedLoads);
-  return load > ceil + EPS ? ceil : load;
+  return load <= ceil + EPS ? ceil : load;
 }
 
killedBy: S-28 · the load holds, and the release is her own measured headroom "within reach": one more rep gives a full rung's worth of headroom, and the rung IS taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 52.5

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:81:10
   const base = rec == null ? anchor : anchor == null ? rec : Math.max(rec, anchor);
   if (base == null) return load;
   const ceil = nextRung(base, meta.equipment, meta.observedLoads);
-  return load > ceil + EPS ? ceil : load;
+  return true ? ceil : load;
 }
 
killedBy: S-28 · the load holds, and the release is her own measured headroom "within reach": one more rep gives a full rung's worth of headroom, and the rung IS taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 52.5

[Killed] BlockStatement
src/engine/v5/loop2.ts:86:73
 
 // ── The stall read (S-25) ──────────────────────────────────────────────────
 /** Her typical attempts-to-clear a load on this lift (nearest-rank 75th percentile, F-13). */
-function attemptsToClearN(history: SessionRecord[], band: Band): number {
-  // Walk newest→oldest, grouping consecutive same-load sessions that END in a clear (all met Tlo).
-  const recent = history.slice(0, RECENCY_WINDOW_SESSIONS);
-  const runs: number[] = [];
-  let run = 0;
-  let runLoad: number | null | undefined;
-  // Oldest-first so a run reads naturally toward its clearing session.
-  for (const rec of [...recent].reverse()) {
-    const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
-    if (runLoad === undefined || rec.load !== runLoad) {
-      run = 0;
-      runLoad = rec.load;
-    }
-    run += 1;
-    if (cleared) {
-      runs.push(run);
-      run = 0;
-      runLoad = undefined;
-    }
-  }
-  if (runs.length === 0) return ATTEMPTS_TO_CLEAR_SEED;
-  return Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
-}
+function attemptsToClearN(history: SessionRecord[], band: Band): number {}
 
 /** Consecutive newest sessions at the CURRENT load that did not clear, incl. this (uncleared) one.
killedBy: 10 weeks of real training, on the real seam woman 52 kg · 4 days · weaker than the model assumed leaves no lift dead on the floor of its equipment
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "dead": Array [],
+   "dead": Array [

[Survived] MethodExpression
src/engine/v5/loop2.ts:88:18
 /** Her typical attempts-to-clear a load on this lift (nearest-rank 75th percentile, F-13). */
 function attemptsToClearN(history: SessionRecord[], band: Band): number {
   // Walk newest→oldest, grouping consecutive same-load sessions that END in a clear (all met Tlo).
-  const recent = history.slice(0, RECENCY_WINDOW_SESSIONS);
+  const recent = history;
   const runs: number[] = [];
   let run = 0;

[Killed] MethodExpression
src/engine/v5/loop2.ts:93:21
   let run = 0;
   let runLoad: number | null | undefined;
   // Oldest-first so a run reads naturally toward its clearing session.
-  for (const rec of [...recent].reverse()) {
+  for (const rec of [...recent]) {
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
     if (runLoad === undefined || rec.load !== runLoad) {
killedBy: the back-off target is read STRICTLY BELOW the wall a clear AT the stalled load is not a step down — the engine still moves
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 60
Received:   60

[Survived] BlockStatement
src/engine/v5/loop2.ts:93:44
   let run = 0;
   let runLoad: number | null | undefined;
   // Oldest-first so a run reads naturally toward its clearing session.
-  for (const rec of [...recent].reverse()) {
-    const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
-    if (runLoad === undefined || rec.load !== runLoad) {
-      run = 0;
-      runLoad = rec.load;
-    }
-    run += 1;
-    if (cleared) {
-      runs.push(run);
-      run = 0;
-      runLoad = undefined;
-    }
-  }
+  for (const rec of [...recent].reverse()) {}
   if (runs.length === 0) return ATTEMPTS_TO_CLEAR_SEED;
   return Math.max(1, percentileNearestRank(runs, N_PERCENTILE));

[Survived] LogicalOperator
src/engine/v5/loop2.ts:94:21
   let runLoad: number | null | undefined;
   // Oldest-first so a run reads naturally toward its clearing session.
   for (const rec of [...recent].reverse()) {
-    const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
+    const cleared = rec.sets.length > 0 || rec.sets.every(s => metTlo(s, band));
     if (runLoad === undefined || rec.load !== runLoad) {
       run = 0;

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:94:21
   let runLoad: number | null | undefined;
   // Oldest-first so a run reads naturally toward its clearing session.
   for (const rec of [...recent].reverse()) {
-    const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
+    const cleared = true;
     if (runLoad === undefined || rec.load !== runLoad) {
       run = 0;

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:95:34
   // Oldest-first so a run reads naturally toward its clearing session.
   for (const rec of [...recent].reverse()) {
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
-    if (runLoad === undefined || rec.load !== runLoad) {
+    if (runLoad === undefined || false) {
       run = 0;
       runLoad = rec.load;
killedBy: S-25.2 · the same wall twice, with a rebuild between back off, re-climb, hit it again → the engine asks to rotate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "hold"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:95:34
   // Oldest-first so a run reads naturally toward its clearing session.
   for (const rec of [...recent].reverse()) {
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
-    if (runLoad === undefined || rec.load !== runLoad) {
+    if (runLoad === undefined || rec.load === runLoad) {
       run = 0;
       runLoad = rec.load;
killedBy: a stall backs off before it rotates, and only rotates when asked twice S-25 · a repeated wall WITH a back-off between reaches for a rotation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "hold"
Received array: ["stall_rotate", "stall_backoff"]

[Survived] AssignmentOperator
src/engine/v5/loop2.ts:99:5
       run = 0;
       runLoad = rec.load;
     }
-    run += 1;
+    run -= 1;
     if (cleared) {
       runs.push(run);

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:100:9
       runLoad = rec.load;
     }
     run += 1;
-    if (cleared) {
+    if (true) {
       runs.push(run);
       run = 0;

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:100:9
       runLoad = rec.load;
     }
     run += 1;
-    if (cleared) {
+    if (false) {
       runs.push(run);
       run = 0;

[Timeout] ConditionalExpression
src/engine/v5/loop2.ts:106:7
       runLoad = undefined;
     }
   }
-  if (runs.length === 0) return ATTEMPTS_TO_CLEAR_SEED;
+  if (false) return ATTEMPTS_TO_CLEAR_SEED;
   return Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
 }

[Timeout] ConditionalExpression
src/engine/v5/loop2.ts:106:7
       runLoad = undefined;
     }
   }
-  if (runs.length === 0) return ATTEMPTS_TO_CLEAR_SEED;
+  if (true) return ATTEMPTS_TO_CLEAR_SEED;
   return Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
 }

[Timeout] MethodExpression
src/engine/v5/loop2.ts:107:10
     }
   }
   if (runs.length === 0) return ATTEMPTS_TO_CLEAR_SEED;
-  return Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
+  return Math.min(1, percentileNearestRank(runs, N_PERCENTILE));
 }
 
