[Killed] BlockStatement
src/engine/v5/loop2.ts:112:74
 
 /** Consecutive newest sessions at the CURRENT load that did not clear, incl. this (uncleared) one.
  *  Loaded lifts only — the bodyweight path runs the same S-25 read on the reps axis instead. */
-function attemptsAtCurrentLoad(state: ExerciseState, band: Band): number {
-  let count = 1;
-  for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
-    const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
-    if (!sameLoad || cleared) break;
-    count += 1;
-  }
-  return count;
-}
+function attemptsAtCurrentLoad(state: ExerciseState, band: Band): number {}
 
 /**
killedBy: the back-off target is read STRICTLY BELOW the wall a clear AT the stalled load is not a step down — the engine still moves
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 60
Received:   60

[Killed] BlockStatement
src/engine/v5/loop2.ts:114:70
  *  Loaded lifts only — the bodyweight path runs the same S-25 read on the reps axis instead. */
 function attemptsAtCurrentLoad(state: ExerciseState, band: Band): number {
   let count = 1;
-  for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
-    const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
-    if (!sameLoad || cleared) break;
-    count += 1;
-  }
+  for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {}
   return count;
 }
killedBy: the back-off target is read STRICTLY BELOW the wall a clear AT the stalled load is not a step down — the engine still moves
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 60
Received:   60

[Survived] MethodExpression
src/engine/v5/loop2.ts:114:21
  *  Loaded lifts only — the bodyweight path runs the same S-25 read on the reps axis instead. */
 function attemptsAtCurrentLoad(state: ExerciseState, band: Band): number {
   let count = 1;
-  for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
+  for (const rec of state.history) {
     const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));

[Killed] EqualityOperator
src/engine/v5/loop2.ts:115:42
 function attemptsAtCurrentLoad(state: ExerciseState, band: Band): number {
   let count = 1;
   for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
+    const sameLoad = rec.load != null && state.load == null && Math.abs(rec.load - state.load) < EPS;
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
     if (!sameLoad || cleared) break;
killedBy: S-25 · a stall backs off, then rotates B-3 · after N failed occurrences at a load, back off to the heaviest full-clear
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_backoff"
Received: "hold"

[Killed] ArithmeticOperator
src/engine/v5/loop2.ts:115:73
 function attemptsAtCurrentLoad(state: ExerciseState, band: Band): number {
   let count = 1;
   for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
+    const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load + state.load) < EPS;
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
     if (!sameLoad || cleared) break;
killedBy: S-25 · a stall backs off, then rotates B-3 · after N failed occurrences at a load, back off to the heaviest full-clear
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_backoff"
Received: "hold"

[Killed] MethodExpression
src/engine/v5/loop2.ts:116:44
   let count = 1;
   for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
-    const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
+    const cleared = rec.sets.length > 0 && rec.sets.some(s => metTlo(s, band));
     if (!sameLoad || cleared) break;
     count += 1;
killedBy: S-25 · a stall backs off, then rotates B-3 · after N failed occurrences at a load, back off to the heaviest full-clear
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_backoff"
Received: "hold"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:116:21
   let count = 1;
   for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
-    const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
+    const cleared = true;
     if (!sameLoad || cleared) break;
     count += 1;
killedBy: the back-off target is read STRICTLY BELOW the wall a clear AT the stalled load is not a step down — the engine still moves
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 60
Received:   60

[Killed] BooleanLiteral
src/engine/v5/loop2.ts:117:9
   for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
-    if (!sameLoad || cleared) break;
+    if (sameLoad || cleared) break;
     count += 1;
   }
killedBy: the back-off target is read STRICTLY BELOW the wall a clear AT the stalled load is not a step down — the engine still moves
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 60
Received:   60

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:117:9
   for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
-    if (!sameLoad || cleared) break;
+    if (false) break;
     count += 1;
   }
killedBy: attempts at the current load — the run that decides a stall a session at a DIFFERENT load ends the run too
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "stall_rotate"

[Killed] AssignmentOperator
src/engine/v5/loop2.ts:118:5
     const sameLoad = rec.load != null && state.load != null && Math.abs(rec.load - state.load) < EPS;
     const cleared = rec.sets.length > 0 && rec.sets.every((s) => metTlo(s, band));
     if (!sameLoad || cleared) break;
-    count += 1;
+    count -= 1;
   }
   return count;
killedBy: the back-off target is read STRICTLY BELOW the wall a clear AT the stalled load is not a step down — the engine still moves
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 60
Received:   60

[Survived] BlockStatement
src/engine/v5/loop2.ts:136:96
  * changeLog to show for it. Reading only below the wall means the engine always has a real step
  * down — her heaviest proven lighter load, else one rung (the caller's fallback).
  */
-function heaviestFullClear(history: SessionRecord[], band: Band, below: number): number | null {
-  let best: number | null = null;
-  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    if (rec.load == null || rec.sets.length === 0) continue;
-    if (rec.load >= below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
-    if (rec.sets.every((s) => metTlo(s, band)) && (best == null || rec.load > best)) best = rec.load;
-  }
-  return best;
-}
+function heaviestFullClear(history: SessionRecord[], band: Band, below: number): number | null {}
 
 // ── The main decision ──────────────────────────────────────────────────────

[Survived] BlockStatement
src/engine/v5/loop2.ts:138:64
  */
 function heaviestFullClear(history: SessionRecord[], band: Band, below: number): number | null {
   let best: number | null = null;
-  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    if (rec.load == null || rec.sets.length === 0) continue;
-    if (rec.load >= below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
-    if (rec.sets.every((s) => metTlo(s, band)) && (best == null || rec.load > best)) best = rec.load;
-  }
+  for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {}
   return best;
 }

[Survived] LogicalOperator
src/engine/v5/loop2.ts:139:9
 function heaviestFullClear(history: SessionRecord[], band: Band, below: number): number | null {
   let best: number | null = null;
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    if (rec.load == null || rec.sets.length === 0) continue;
+    if (rec.load == null && rec.sets.length === 0) continue;
     if (rec.load >= below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
     if (rec.sets.every((s) => metTlo(s, band)) && (best == null || rec.load > best)) best = rec.load;

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:139:29
 function heaviestFullClear(history: SessionRecord[], band: Band, below: number): number | null {
   let best: number | null = null;
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-    if (rec.load == null || rec.sets.length === 0) continue;
+    if (rec.load == null || false) continue;
     if (rec.load >= below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
     if (rec.sets.every((s) => metTlo(s, band)) && (best == null || rec.load > best)) best = rec.load;

[Killed] EqualityOperator
src/engine/v5/loop2.ts:140:9
   let best: number | null = null;
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     if (rec.load == null || rec.sets.length === 0) continue;
-    if (rec.load >= below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
+    if (rec.load < below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
     if (rec.sets.every((s) => metTlo(s, band)) && (best == null || rec.load > best)) best = rec.load;
   }
killedBy: the back-off target is read STRICTLY BELOW the wall a clear AT the stalled load is not a step down — the engine still moves
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 60
Received:   60

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:140:9
   let best: number | null = null;
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     if (rec.load == null || rec.sets.length === 0) continue;
-    if (rec.load >= below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
+    if (false) continue; // not a back-off — S-25.1 steps DOWN or not at all
     if (rec.sets.every((s) => metTlo(s, band)) && (best == null || rec.load > best)) best = rec.load;
   }
killedBy: the back-off target is read STRICTLY BELOW the wall a clear AT the stalled load is not a step down — the engine still moves
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 60
Received:   60

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:141:9
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     if (rec.load == null || rec.sets.length === 0) continue;
     if (rec.load >= below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
-    if (rec.sets.every((s) => metTlo(s, band)) && (best == null || rec.load > best)) best = rec.load;
+    if (false) best = rec.load;
   }
   return best;

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:141:9
   for (const rec of history.slice(0, RECENCY_WINDOW_SESSIONS)) {
     if (rec.load == null || rec.sets.length === 0) continue;
     if (rec.load >= below - EPS) continue; // not a back-off — S-25.1 steps DOWN or not at all
-    if (rec.sets.every((s) => metTlo(s, band)) && (best == null || rec.load > best)) best = rec.load;
+    if (true) best = rec.load;
   }
   return best;

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:161:7
   const sets = working(inp.session);
 
   // Bodyweight has its own axis (S-51/52).
-  if (meta.bodyweight || state.load == null) return decideBodyweight(inp, sets);
+  if (false) return decideBodyweight(inp, sets);
 
   // S-16: no usable working data → hold, bank nothing.
killedBy: bodyweight has no load axis (S-51/S-52) S-52 · held at the top of the band, it graduates rather than adding load
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stall_rotate"
Received array: ["graduate", "progress", "hold"]

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:161:7
   const sets = working(inp.session);
 
   // Bodyweight has its own axis (S-51/52).
-  if (meta.bodyweight || state.load == null) return decideBodyweight(inp, sets);
+  if (true) return decideBodyweight(inp, sets);
 
   // S-16: no usable working data → hold, bank nothing.
killedBy: 10 weeks of real training, on the real seam woman 52 kg · 4 days · weaker than the model assumed keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 100
Received:   0

[Killed] MethodExpression
src/engine/v5/loop2.ts:164:18
   if (meta.bodyweight || state.load == null) return decideBodyweight(inp, sets);
 
   // S-16: no usable working data → hold, bank nothing.
-  const usable = sets.filter((s) => s.load != null && s.reps > 0);
+  const usable = sets;
   if (usable.length === 0) {
     // ════ ZERO REPS IS DATA — AND ON A FLOORED LIFT IT IS THE ONLY DATA THAT MATTERS ════
killedBy: S-16 · an ambiguous session (no usable working set) holds the load all-zero → hold, bank nothing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ambiguous"
Received: "hold"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:164:37
   if (meta.bodyweight || state.load == null) return decideBodyweight(inp, sets);
 
   // S-16: no usable working data → hold, bank nothing.
-  const usable = sets.filter((s) => s.load != null && s.reps > 0);
+  const usable = sets.filter((s) => s.load == null && s.reps > 0);
   if (usable.length === 0) {
     // ════ ZERO REPS IS DATA — AND ON A FLOORED LIFT IT IS THE ONLY DATA THAT MATTERS ════
killedBy: S-22 · all working sets met Tlo → the load goes up progress, and the athlete never has to reach the top of the band
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: "ambiguous"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:165:7
 
   // S-16: no usable working data → hold, bank nothing.
   const usable = sets.filter((s) => s.load != null && s.reps > 0);
-  if (usable.length === 0) {
+  if (usable.length !== 0) {
     // ════ ZERO REPS IS DATA — AND ON A FLOORED LIFT IT IS THE ONLY DATA THAT MATTERS ════
     //
killedBy: 10 weeks of real training, on the real seam woman 52 kg · 4 days · weaker than the model assumed never LEAVES her on a load she cannot lift
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 9

  Object {
-   "leftAboveHer": Array [],
+   "leftAboveHer": Array [

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:165:7
 
   // S-16: no usable working data → hold, bank nothing.
   const usable = sets.filter((s) => s.load != null && s.reps > 0);
-  if (usable.length === 0) {
+  if (true) {
     // ════ ZERO REPS IS DATA — AND ON A FLOORED LIFT IT IS THE ONLY DATA THAT MATTERS ════
     //
killedBy: S-22 · all working sets met Tlo → the load goes up progress, and the athlete never has to reach the top of the band
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: "ambiguous"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:182:23
     //
     // The count is hers, not ours: more consecutive all-zero occurrences than her own
     // attempts-to-clear (B-3 until she has a statistic). One aborted set still just holds.
-    const attempted = sets.length > 0;
+    const attempted = sets.length <= 0;
     const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && !rec.sets.some((s) => s.load != null && s.reps > 0);
     if (attempted && inp.rotationAvailable) {
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:182:23
     //
     // The count is hers, not ours: more consecutive all-zero occurrences than her own
     // attempts-to-clear (B-3 until she has a statistic). One aborted set still just holds.
-    const attempted = sets.length > 0;
+    const attempted = false;
     const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && !rec.sets.some((s) => s.load != null && s.reps > 0);
     if (attempted && inp.rotationAvailable) {
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] ArrowFunction
src/engine/v5/loop2.ts:183:24
     // The count is hers, not ours: more consecutive all-zero occurrences than her own
     // attempts-to-clear (B-3 until she has a statistic). One aborted set still just holds.
     const attempted = sets.length > 0;
-    const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && !rec.sets.some((s) => s.load != null && s.reps > 0);
+    const noneUsable = () => undefined;
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] BooleanLiteral
src/engine/v5/loop2.ts:183:71
     // The count is hers, not ours: more consecutive all-zero occurrences than her own
     // attempts-to-clear (B-3 until she has a statistic). One aborted set still just holds.
     const attempted = sets.length > 0;
-    const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && !rec.sets.some((s) => s.load != null && s.reps > 0);
+    const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && rec.sets.some(s => s.load != null && s.reps > 0);
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] BlockStatement
src/engine/v5/loop2.ts:184:45
     // attempts-to-clear (B-3 until she has a statistic). One aborted set still just holds.
     const attempted = sets.length > 0;
     const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && !rec.sets.some((s) => s.load != null && s.reps > 0);
-    if (attempted && inp.rotationAvailable) {
-      let zeros = 1; // this occurrence
-      for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-        if (!noneUsable(rec)) break;
-        zeros += 1;
-      }
-      if (zeros > attemptsToClearN(state.history, band)) {
-        return { decision: 'stall_rotate', load: state.load, band, sets: state.sets, wantsChange: 'rotate' };
-      }
-    }
+    if (attempted && inp.rotationAvailable) {}
     return { decision: 'ambiguous', load: state.load, band, sets: state.sets };
   }
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:184:9
     // attempts-to-clear (B-3 until she has a statistic). One aborted set still just holds.
     const attempted = sets.length > 0;
     const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && !rec.sets.some((s) => s.load != null && s.reps > 0);
-    if (attempted && inp.rotationAvailable) {
+    if (false) {
       let zeros = 1; // this occurrence
       for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] BlockStatement
src/engine/v5/loop2.ts:186:74
     const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && !rec.sets.some((s) => s.load != null && s.reps > 0);
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
-      for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-        if (!noneUsable(rec)) break;
-        zeros += 1;
-      }
+      for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {}
       if (zeros > attemptsToClearN(state.history, band)) {
         return { decision: 'stall_rotate', load: state.load, band, sets: state.sets, wantsChange: 'rotate' };
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Survived] MethodExpression
src/engine/v5/loop2.ts:186:25
     const noneUsable = (rec: SessionRecord) => rec.sets.length > 0 && !rec.sets.some((s) => s.load != null && s.reps > 0);
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
-      for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
+      for (const rec of state.history) {
         if (!noneUsable(rec)) break;
         zeros += 1;

[Killed] BooleanLiteral
src/engine/v5/loop2.ts:187:13
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
       for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-        if (!noneUsable(rec)) break;
+        if (noneUsable(rec)) break;
         zeros += 1;
       }
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:187:13
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
       for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-        if (!noneUsable(rec)) break;
+        if (true) break;
         zeros += 1;
       }
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] AssignmentOperator
src/engine/v5/loop2.ts:188:9
       let zeros = 1; // this occurrence
       for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
         if (!noneUsable(rec)) break;
-        zeros += 1;
+        zeros -= 1;
       }
       if (zeros > attemptsToClearN(state.history, band)) {
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] BlockStatement
src/engine/v5/loop2.ts:190:58
         if (!noneUsable(rec)) break;
         zeros += 1;
       }
-      if (zeros > attemptsToClearN(state.history, band)) {
-        return { decision: 'stall_rotate', load: state.load, band, sets: state.sets, wantsChange: 'rotate' };
-      }
+      if (zeros > attemptsToClearN(state.history, band)) {}
     }
     return { decision: 'ambiguous', load: state.load, band, sets: state.sets };
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:190:11
         if (!noneUsable(rec)) break;
         zeros += 1;
       }
-      if (zeros > attemptsToClearN(state.history, band)) {
+      if (false) {
         return { decision: 'stall_rotate', load: state.load, band, sets: state.sets, wantsChange: 'rotate' };
       }
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] StringLiteral
src/engine/v5/loop2.ts:191:99
         zeros += 1;
       }
       if (zeros > attemptsToClearN(state.history, band)) {
-        return { decision: 'stall_rotate', load: state.load, band, sets: state.sets, wantsChange: 'rotate' };
+        return { decision: 'stall_rotate', load: state.load, band, sets: state.sets, wantsChange: "" };
       }
     }
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rotate"
Received: ""

[Killed] ObjectLiteral
src/engine/v5/loop2.ts:191:16
         zeros += 1;
       }
       if (zeros > attemptsToClearN(state.history, band)) {
-        return { decision: 'stall_rotate', load: state.load, band, sets: state.sets, wantsChange: 'rotate' };
+        return {};
       }
     }
killedBy: S-16 · "no usable data" and "she got zero" are not the same fact a loaded lift at the bar floor she cannot do ONE rep of is rotated away
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: undefined

[Killed] ArrowFunction
src/engine/v5/loop2.ts:197:29
     return { decision: 'ambiguous', load: state.load, band, sets: state.sets };
   }
 
-  const allMet = sets.every((s) => metTlo(s, band));
+  const allMet = sets.every(() => undefined);
   const metLoads = sets.filter((s) => metTlo(s, band)).map((s) => s.load as number);
 
killedBy: S-22 · all working sets met Tlo → the load goes up progress, and the athlete never has to reach the top of the band
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: "hold"

[Killed] MethodExpression
src/engine/v5/loop2.ts:197:18
     return { decision: 'ambiguous', load: state.load, band, sets: state.sets };
   }
 
-  const allMet = sets.every((s) => metTlo(s, band));
+  const allMet = sets.some(s => metTlo(s, band));
   const metLoads = sets.filter((s) => metTlo(s, band)).map((s) => s.load as number);
 
killedBy: 10 weeks of real training, on the real seam woman 58 kg · 3 days keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "shortOfTarget": StringMatching /^(\d|1\d|2[0-4])\.\d%$/,
+   "shortOfTarget": "27.5%",

[Killed] ArrowFunction
src/engine/v5/loop2.ts:198:32
   }
 
   const allMet = sets.every((s) => metTlo(s, band));
-  const metLoads = sets.filter((s) => metTlo(s, band)).map((s) => s.load as number);
+  const metLoads = sets.filter(() => undefined).map((s) => s.load as number);
 
   // The anchor (L10): median of the loads of sets that met Tlo, snapped down. If none met, hold at
killedBy: L10 · the anchor is the MEDIAN of met-Tlo sets — a fat finger cannot be the median S-14 · a mis-keyed 400 among 80s does not move the prescription off 80
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 100
Received:   402.5

[Killed] ArrowFunction
src/engine/v5/loop2.ts:198:60
   }
 
   const allMet = sets.every((s) => metTlo(s, band));
-  const metLoads = sets.filter((s) => metTlo(s, band)).map((s) => s.load as number);
+  const metLoads = sets.filter((s) => metTlo(s, band)).map(() => undefined);
 
   // The anchor (L10): median of the loads of sets that met Tlo, snapped down. If none met, hold at
killedBy: 10 weeks of real training, on the real seam woman 52 kg · 4 days · weaker than the model assumed keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 100
Received:   7
