[Killed] ConditionalExpression
src/engine/v5/loop2.ts:206:7
     ? snapDown(median(metLoads), meta.equipment, meta.observedLoads)
     : snapDown((usable[usable.length - 1].load as number), meta.equipment, meta.observedLoads);
 
-  if (allMet) {
+  if (false) {
     // S-22: progress. Move up by as many rungs as her measured headroom over Tlo justifies.
     const worstReps = Math.min(...sets.map((s) => s.reps));
killedBy: the app and the engine agree, after six weeks of real training the athlete really did produce the hard cases — corrections, holds and moves
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/engine/v5/loop2.ts:206:15
     ? snapDown(median(metLoads), meta.equipment, meta.observedLoads)
     : snapDown((usable[usable.length - 1].load as number), meta.equipment, meta.observedLoads);
 
-  if (allMet) {
-    // S-22: progress. Move up by as many rungs as her measured headroom over Tlo justifies.
-    const worstReps = Math.min(...sets.map((s) => s.reps));
-    // The rung she is about to be asked for — priced at THE ANCHOR, not at her grid's top (S-28).
-    const perRung = repsPerRung(inp.session, state.history, meta, anchor);
-
-    // S-28 · THE NEXT RUNG IS A BIG JUMP. Two conditions, both stated in the situation itself:
-    //   (1) "a machine with 10 kg pins; NO MICRO-LOADING" — the real rung exceeds the equipment's
-    //       finest step (isBigJump). False on a barbell, so S-22 below is untouched there.
-    //   (2) "the load cannot move without breaking her" — her own measured reps-per-rung says the
-    //       step lands her under Tlo. The release is the same number read the other way: "when her
-    //       reps give her a FULL RUNG'S WORTH OF HEADROOM, the rung is taken" (reps − perRung ≥ Tlo).
-    // Then: "T is hers, so the engine may not quietly raise it" — the load HOLDS at the anchor, she
-    // climbs reps at it, and the engine SAYS SO. Silent until her slope is fitted (F-12): with no
-    // measured perRung there is no fact that the jump breaks her, and B-5's cautious rung stands.
-    if (rungOutOfReach(anchor, band, perRung, meta, worstReps)) {
-      return { decision: 'rung_out_of_reach', load: anchor, band, sets: state.sets };
-    }
-
-    const n = rungsForHeadroom(worstReps - band.lo, perRung);
-    let load = snapDown(moveRungs(anchor, n, meta.equipment, meta.observedLoads), meta.equipment, meta.observedLoads);
-    load = applyRail(load, state.history, band, meta, anchor); // L11 (base = max(settled, anchor))
-    return { decision: 'progress', load, band, sets: state.sets };
-  }
+  if (allMet) {}
 
   // Not all met Tlo → S-24 hold, unless it is a stall (S-25).
killedBy: S-22 · all working sets met Tlo → the load goes up progress, and the athlete never has to reach the top of the band
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: "hold"

[Killed] ArrowFunction
src/engine/v5/loop2.ts:208:44
 
   if (allMet) {
     // S-22: progress. Move up by as many rungs as her measured headroom over Tlo justifies.
-    const worstReps = Math.min(...sets.map((s) => s.reps));
+    const worstReps = Math.min(...sets.map(() => undefined));
     // The rung she is about to be asked for — priced at THE ANCHOR, not at her grid's top (S-28).
     const perRung = repsPerRung(inp.session, state.history, meta, anchor);
killedBy: S-28 · the load holds, and the release is her own measured headroom she cleared every set — but the step would land her under Tlo, so the load HOLDS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rung_out_of_reach"
Received: "progress"

[Survived] MethodExpression
src/engine/v5/loop2.ts:208:23
 
   if (allMet) {
     // S-22: progress. Move up by as many rungs as her measured headroom over Tlo justifies.
-    const worstReps = Math.min(...sets.map((s) => s.reps));
+    const worstReps = Math.max(...sets.map(s => s.reps));
     // The rung she is about to be asked for — priced at THE ANCHOR, not at her grid's top (S-28).
     const perRung = repsPerRung(inp.session, state.history, meta, anchor);

[Killed] BlockStatement
src/engine/v5/loop2.ts:221:65
     // Then: "T is hers, so the engine may not quietly raise it" — the load HOLDS at the anchor, she
     // climbs reps at it, and the engine SAYS SO. Silent until her slope is fitted (F-12): with no
     // measured perRung there is no fact that the jump breaks her, and B-5's cautious rung stands.
-    if (rungOutOfReach(anchor, band, perRung, meta, worstReps)) {
-      return { decision: 'rung_out_of_reach', load: anchor, band, sets: state.sets };
-    }
+    if (rungOutOfReach(anchor, band, perRung, meta, worstReps)) {}
 
     const n = rungsForHeadroom(worstReps - band.lo, perRung);
killedBy: S-28 · the load holds, and the release is her own measured headroom she cleared every set — but the step would land her under Tlo, so the load HOLDS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rung_out_of_reach"
Received: "progress"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:221:9
     // Then: "T is hers, so the engine may not quietly raise it" — the load HOLDS at the anchor, she
     // climbs reps at it, and the engine SAYS SO. Silent until her slope is fitted (F-12): with no
     // measured perRung there is no fact that the jump breaks her, and B-5's cautious rung stands.
-    if (rungOutOfReach(anchor, band, perRung, meta, worstReps)) {
+    if (true) {
       return { decision: 'rung_out_of_reach', load: anchor, band, sets: state.sets };
     }
killedBy: the app and the engine agree, after six weeks of real training the athlete really did produce the hard cases — corrections, holds and moves
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/engine/v5/loop2.ts:222:26
     // climbs reps at it, and the engine SAYS SO. Silent until her slope is fitted (F-12): with no
     // measured perRung there is no fact that the jump breaks her, and B-5's cautious rung stands.
     if (rungOutOfReach(anchor, band, perRung, meta, worstReps)) {
-      return { decision: 'rung_out_of_reach', load: anchor, band, sets: state.sets };
+      return { decision: "", load: anchor, band, sets: state.sets };
     }
 
killedBy: S-28 · the load holds, and the release is her own measured headroom she cleared every set — but the step would land her under Tlo, so the load HOLDS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rung_out_of_reach"
Received: ""

[Killed] ArithmeticOperator
src/engine/v5/loop2.ts:225:32
       return { decision: 'rung_out_of_reach', load: anchor, band, sets: state.sets };
     }
 
-    const n = rungsForHeadroom(worstReps - band.lo, perRung);
+    const n = rungsForHeadroom(worstReps + band.lo, perRung);
     let load = snapDown(moveRungs(anchor, n, meta.equipment, meta.observedLoads), meta.equipment, meta.observedLoads);
     load = applyRail(load, state.history, band, meta, anchor); // L11 (base = max(settled, anchor))
killedBy: S-28 · the load holds, and the release is her own measured headroom "within reach": one more rep gives a full rung's worth of headroom, and the rung IS taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 52.5

[Killed] StringLiteral
src/engine/v5/loop2.ts:228:24
     const n = rungsForHeadroom(worstReps - band.lo, perRung);
     let load = snapDown(moveRungs(anchor, n, meta.equipment, meta.observedLoads), meta.equipment, meta.observedLoads);
     load = applyRail(load, state.history, band, meta, anchor); // L11 (base = max(settled, anchor))
-    return { decision: 'progress', load, band, sets: state.sets };
+    return { decision: "", load, band, sets: state.sets };
   }
 
killedBy: S-28 · the load holds, and the release is her own measured headroom "within reach": one more rep gives a full rung's worth of headroom, and the rung IS taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: ""

[Killed] ObjectLiteral
src/engine/v5/loop2.ts:228:12
     const n = rungsForHeadroom(worstReps - band.lo, perRung);
     let load = snapDown(moveRungs(anchor, n, meta.equipment, meta.observedLoads), meta.equipment, meta.observedLoads);
     load = applyRail(load, state.history, band, meta, anchor); // L11 (base = max(settled, anchor))
-    return { decision: 'progress', load, band, sets: state.sets };
+    return {};
   }
 
killedBy: S-28 · the load holds, and the release is her own measured headroom "within reach": one more rep gives a full rung's worth of headroom, and the rung IS taken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: undefined

[Killed] EqualityOperator
src/engine/v5/loop2.ts:236:7
   const N = attemptsToClearN(state.history, band);
 
   // S-25: a stall is failing this load MORE times than her own typical attempts-to-clear (strict).
-  if (attempts > N) {
+  if (attempts <= N) {
     // S-25.1: back off to the heaviest full-clear load, else one rung down; re-climb. The load backs
     // off in BOTH the back-off and the rotate case (the rotated-from lift trains it until the roll).
killedBy: a stall backs off before it rotates, and only rotates when asked twice S-25 · a repeated wall WITH a back-off between reaches for a rotation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "hold"
Received array: ["stall_rotate", "stall_backoff"]

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:236:7
   const N = attemptsToClearN(state.history, band);
 
   // S-25: a stall is failing this load MORE times than her own typical attempts-to-clear (strict).
-  if (attempts > N) {
+  if (false) {
     // S-25.1: back off to the heaviest full-clear load, else one rung down; re-climb. The load backs
     // off in BOTH the back-off and the rotate case (the rotated-from lift trains it until the roll).
killedBy: a stall backs off before it rotates, and only rotates when asked twice S-25 · a repeated wall WITH a back-off between reaches for a rotation
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "hold"
Received array: ["stall_rotate", "stall_backoff"]

[Killed] EqualityOperator
src/engine/v5/loop2.ts:240:18
     // S-25.1: back off to the heaviest full-clear load, else one rung down; re-climb. The load backs
     // off in BOTH the back-off and the rotate case (the rotated-from lift trains it until the roll).
     const backTo = heaviestFullClear(state.history, band, state.load);
-    const load = backTo != null
+    const load = backTo == null
       ? snapDown(backTo, meta.equipment, meta.observedLoads)
       : Math.max(loadFloor(meta.equipment, meta.observedLoads), prevRung(state.load, meta.equipment, meta.observedLoads));
killedBy: 10 weeks of real training, on the real seam man 80 kg · 4 days keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "shortOfTarget": StringMatching /^(\d|1\d|2[0-4])\.\d%$/,
+   "shortOfTarget": "32.1%",

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:240:18
     // S-25.1: back off to the heaviest full-clear load, else one rung down; re-climb. The load backs
     // off in BOTH the back-off and the rotate case (the rotated-from lift trains it until the roll).
     const backTo = heaviestFullClear(state.history, band, state.load);
-    const load = backTo != null
+    const load = true
       ? snapDown(backTo, meta.equipment, meta.observedLoads)
       : Math.max(loadFloor(meta.equipment, meta.observedLoads), prevRung(state.load, meta.equipment, meta.observedLoads));
killedBy: 10 weeks of real training, on the real seam man 80 kg · 4 days keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "shortOfTarget": StringMatching /^(\d|1\d|2[0-4])\.\d%$/,
+   "shortOfTarget": "32.1%",

[Killed] MethodExpression
src/engine/v5/loop2.ts:242:9
     const backTo = heaviestFullClear(state.history, band, state.load);
     const load = backTo != null
       ? snapDown(backTo, meta.equipment, meta.observedLoads)
-      : Math.max(loadFloor(meta.equipment, meta.observedLoads), prevRung(state.load, meta.equipment, meta.observedLoads));
+      : Math.min(loadFloor(meta.equipment, meta.observedLoads), prevRung(state.load, meta.equipment, meta.observedLoads));
     // ════ S-25.1 IS UNAVAILABLE AT THE FLOOR — SO STEP 2 IS THE ONLY STEP LEFT ════
     //
killedBy: 10 weeks of real training, on the real seam man 80 kg · 4 days keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "shortOfTarget": StringMatching /^(\d|1\d|2[0-4])\.\d%$/,
+   "shortOfTarget": "32.1%",

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:255:21
     //
     // It is reachable on real equipment: a beginner on the empty bar, or on the first pin of a
     // stack. This is not a new rule — it is S-25's own step 2, taken because step 1 is exhausted.
-    const atFloor = Math.abs(load - state.load) < EPS
-      && Math.abs(state.load - loadFloor(meta.equipment, meta.observedLoads)) < EPS;
+    const atFloor = false;
     // S-25.2: otherwise rotate ONLY on a REPEATED stall at the same wall (back-off-and-re-climb has
     // failed) — never on a first stall. `wantsChange` signals the structural swap, enacted only if a
killedBy: the floor is the one place a first stall may rotate at once stalled ON the bar with a rotation available → rotate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] ArithmeticOperator
src/engine/v5/loop2.ts:255:30
     //
     // It is reachable on real equipment: a beginner on the empty bar, or on the first pin of a
     // stack. This is not a new rule — it is S-25's own step 2, taken because step 1 is exhausted.
-    const atFloor = Math.abs(load - state.load) < EPS
+    const atFloor = Math.abs(load + state.load) < EPS
       && Math.abs(state.load - loadFloor(meta.equipment, meta.observedLoads)) < EPS;
     // S-25.2: otherwise rotate ONLY on a REPEATED stall at the same wall (back-off-and-re-climb has
killedBy: the floor is the one place a first stall may rotate at once stalled ON the bar with a rotation available → rotate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:256:10
     // It is reachable on real equipment: a beginner on the empty bar, or on the first pin of a
     // stack. This is not a new rule — it is S-25's own step 2, taken because step 1 is exhausted.
     const atFloor = Math.abs(load - state.load) < EPS
-      && Math.abs(state.load - loadFloor(meta.equipment, meta.observedLoads)) < EPS;
+      && Math.abs(state.load - loadFloor(meta.equipment, meta.observedLoads)) >= EPS;
     // S-25.2: otherwise rotate ONLY on a REPEATED stall at the same wall (back-off-and-re-climb has
     // failed) — never on a first stall. `wantsChange` signals the structural swap, enacted only if a
killedBy: the floor is the one place a first stall may rotate at once stalled ON the bar with a rotation available → rotate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] ArithmeticOperator
src/engine/v5/loop2.ts:256:19
     // It is reachable on real equipment: a beginner on the empty bar, or on the first pin of a
     // stack. This is not a new rule — it is S-25's own step 2, taken because step 1 is exhausted.
     const atFloor = Math.abs(load - state.load) < EPS
-      && Math.abs(state.load - loadFloor(meta.equipment, meta.observedLoads)) < EPS;
+      && Math.abs(state.load + loadFloor(meta.equipment, meta.observedLoads)) < EPS;
     // S-25.2: otherwise rotate ONLY on a REPEATED stall at the same wall (back-off-and-re-climb has
     // failed) — never on a first stall. `wantsChange` signals the structural swap, enacted only if a
killedBy: the floor is the one place a first stall may rotate at once stalled ON the bar with a rotation available → rotate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] BlockStatement
src/engine/v5/loop2.ts:261:97
     // failed) — never on a first stall. `wantsChange` signals the structural swap, enacted only if a
     // same-muscle target exists (else the lift simply backs off, S-53). rotationAvailable stays a
     // hook the caller may gate; the persistence test is the trigger.
-    if (inp.rotationAvailable && (atFloor || isRepeatedStall(state.history, state.load, band))) {
-      return { decision: 'stall_rotate', load, band, sets: state.sets, wantsChange: 'rotate' };
-    }
+    if (inp.rotationAvailable && (atFloor || isRepeatedStall(state.history, state.load, band))) {}
     return { decision: 'stall_backoff', load, band, sets: state.sets };
   }
killedBy: S-25.2 · the same wall twice, with a rebuild between back off, re-climb, hit it again → the engine asks to rotate
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "stall_backoff"

[Killed] LogicalOperator
src/engine/v5/loop2.ts:261:9
     // failed) — never on a first stall. `wantsChange` signals the structural swap, enacted only if a
     // same-muscle target exists (else the lift simply backs off, S-53). rotationAvailable stays a
     // hook the caller may gate; the persistence test is the trigger.
-    if (inp.rotationAvailable && (atFloor || isRepeatedStall(state.history, state.load, band))) {
+    if (inp.rotationAvailable || atFloor || isRepeatedStall(state.history, state.load, band)) {
       return { decision: 'stall_rotate', load, band, sets: state.sets, wantsChange: 'rotate' };
     }
killedBy: 10 weeks of real training, on the real seam man 80 kg · 4 days keeps the contract: fewer than a quarter of her sets come in under her target reps
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "shortOfTarget": StringMatching /^(\d|1\d|2[0-4])\.\d%$/,
+   "shortOfTarget": "25.4%",

[Killed] ObjectLiteral
src/engine/v5/loop2.ts:262:14
     // same-muscle target exists (else the lift simply backs off, S-53). rotationAvailable stays a
     // hook the caller may gate; the persistence test is the trigger.
     if (inp.rotationAvailable && (atFloor || isRepeatedStall(state.history, state.load, band))) {
-      return { decision: 'stall_rotate', load, band, sets: state.sets, wantsChange: 'rotate' };
+      return {};
     }
     return { decision: 'stall_backoff', load, band, sets: state.sets };
killedBy: 10 weeks of real training, on the real seam woman 52 kg · 4 days · weaker than the model assumed leaves no lift dead on the floor of its equipment
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "dead": Array [],
+   "dead": Array [

[Killed] BlockStatement
src/engine/v5/loop2.ts:274:52
 // ── Bodyweight (S-51/52/53) ────────────────────────────────────────────────
 /** The occurrence's WORST working set's reps — the scalar the reps axis progresses on (S-51). Reads
  *  ALL sets, the same discipline as S-22 ("10/9/8 ≠ 10/7/5"). null when nothing was performed. */
-function repsScore(sets: SetPerf[]): number | null {
-  const usable = sets.filter((s) => !s.isApproach && s.reps > 0);
-  if (usable.length === 0) return null;
-  return Math.min(...usable.map((s) => s.reps));
-}
+function repsScore(sets: SetPerf[]): number | null {}
 
 /**
killedBy: bodyweight has no load axis (S-51/S-52) S-52 · held at the top of the band, it graduates rather than adding load
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stall_rotate"
Received array: ["graduate", "progress", "hold"]

[Killed] LogicalOperator
src/engine/v5/loop2.ts:275:37
 /** The occurrence's WORST working set's reps — the scalar the reps axis progresses on (S-51). Reads
  *  ALL sets, the same discipline as S-22 ("10/9/8 ≠ 10/7/5"). null when nothing was performed. */
 function repsScore(sets: SetPerf[]): number | null {
-  const usable = sets.filter((s) => !s.isApproach && s.reps > 0);
+  const usable = sets.filter((s) => !s.isApproach || s.reps > 0);
   if (usable.length === 0) return null;
   return Math.min(...usable.map((s) => s.reps));
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "graduate"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:275:54
 /** The occurrence's WORST working set's reps — the scalar the reps axis progresses on (S-51). Reads
  *  ALL sets, the same discipline as S-22 ("10/9/8 ≠ 10/7/5"). null when nothing was performed. */
 function repsScore(sets: SetPerf[]): number | null {
-  const usable = sets.filter((s) => !s.isApproach && s.reps > 0);
+  const usable = sets.filter((s) => !s.isApproach && s.reps >= 0);
   if (usable.length === 0) return null;
   return Math.min(...usable.map((s) => s.reps));
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "graduate"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:276:7
  *  ALL sets, the same discipline as S-22 ("10/9/8 ≠ 10/7/5"). null when nothing was performed. */
 function repsScore(sets: SetPerf[]): number | null {
   const usable = sets.filter((s) => !s.isApproach && s.reps > 0);
-  if (usable.length === 0) return null;
+  if (false) return null;
   return Math.min(...usable.map((s) => s.reps));
 }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "graduate"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:276:7
  *  ALL sets, the same discipline as S-22 ("10/9/8 ≠ 10/7/5"). null when nothing was performed. */
 function repsScore(sets: SetPerf[]): number | null {
   const usable = sets.filter((s) => !s.isApproach && s.reps > 0);
-  if (usable.length === 0) return null;
+  if (true) return null;
   return Math.min(...usable.map((s) => s.reps));
 }
killedBy: bodyweight has no load axis (S-51/S-52) S-52 · held at the top of the band, it graduates rather than adding load
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stall_rotate"
Received array: ["graduate", "progress", "hold"]

[Killed] ArrowFunction
src/engine/v5/loop2.ts:277:33
 function repsScore(sets: SetPerf[]): number | null {
   const usable = sets.filter((s) => !s.isApproach && s.reps > 0);
   if (usable.length === 0) return null;
-  return Math.min(...usable.map((s) => s.reps));
+  return Math.min(...usable.map(() => undefined));
 }
 
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall climbing below Tlo — every fresh post-graduation lift — is PROGRESS, never a chain-graduation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: "hold"

[Survived] MethodExpression
src/engine/v5/loop2.ts:277:10
 function repsScore(sets: SetPerf[]): number | null {
   const usable = sets.filter((s) => !s.isApproach && s.reps > 0);
   if (usable.length === 0) return null;
-  return Math.min(...usable.map((s) => s.reps));
+  return Math.max(...usable.map(s => s.reps));
 }
 

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:302:7
   const { state } = inp;
   const band = state.band;
   const score = repsScore(sets);
-  if (score == null) {
+  if (true) {
     // ════ SHE TRIED IT AND COULD NOT DO ONE REP ════
     //
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall every set reaches Thi → graduate (too easy)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "ambiguous"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:302:7
   const { state } = inp;
   const band = state.band;
   const score = repsScore(sets);
-  if (score == null) {
+  if (score != null) {
     // ════ SHE TRIED IT AND COULD NOT DO ONE REP ════
     //
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall every set reaches Thi → graduate (too easy)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "ambiguous"

[Killed] ArrowFunction
src/engine/v5/loop2.ts:319:33
     //
     // The count is her own, not ours: more consecutive all-zero occurrences than her attempts-to-
     // clear (B-3 until she has a statistic). One bad day still just holds.
-    const attempted = sets.some((s) => !s.isApproach);
+    const attempted = sets.some(() => undefined);
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] BooleanLiteral
src/engine/v5/loop2.ts:319:40
     //
     // The count is her own, not ours: more consecutive all-zero occurrences than her attempts-to-
     // clear (B-3 until she has a statistic). One bad day still just holds.
-    const attempted = sets.some((s) => !s.isApproach);
+    const attempted = sets.some((s) => s.isApproach);
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:320:9
     // The count is her own, not ours: more consecutive all-zero occurrences than her attempts-to-
     // clear (B-3 until she has a statistic). One bad day still just holds.
     const attempted = sets.some((s) => !s.isApproach);
-    if (attempted && inp.rotationAvailable) {
+    if (false) {
       let zeros = 1; // this occurrence
       for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] BlockStatement
src/engine/v5/loop2.ts:320:45
     // The count is her own, not ours: more consecutive all-zero occurrences than her attempts-to-
     // clear (B-3 until she has a statistic). One bad day still just holds.
     const attempted = sets.some((s) => !s.isApproach);
-    if (attempted && inp.rotationAvailable) {
-      let zeros = 1; // this occurrence
-      for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-        if (repsScore(rec.sets) != null || rec.sets.length === 0) break;
-        zeros += 1;
-      }
-      if (zeros > attemptsToClearN(state.history, band)) {
-        return { decision: 'stall_rotate', load: null, band, sets: state.sets, wantsChange: 'rotate' };
-      }
-    }
+    if (attempted && inp.rotationAvailable) {}
     return { decision: 'ambiguous', load: null, band, sets: state.sets };
   }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] BlockStatement
src/engine/v5/loop2.ts:322:74
     const attempted = sets.some((s) => !s.isApproach);
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
-      for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-        if (repsScore(rec.sets) != null || rec.sets.length === 0) break;
-        zeros += 1;
-      }
+      for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {}
       if (zeros > attemptsToClearN(state.history, band)) {
         return { decision: 'stall_rotate', load: null, band, sets: state.sets, wantsChange: 'rotate' };
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"
