[Killed] EqualityOperator
src/engine/v5/loop2.ts:323:44
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
       for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-        if (repsScore(rec.sets) != null || rec.sets.length === 0) break;
+        if (repsScore(rec.sets) != null || rec.sets.length !== 0) break;
         zeros += 1;
       }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:323:13
     if (attempted && inp.rotationAvailable) {
       let zeros = 1; // this occurrence
       for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
-        if (repsScore(rec.sets) != null || rec.sets.length === 0) break;
+        if (repsScore(rec.sets) == null || rec.sets.length === 0) break;
         zeros += 1;
       }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] AssignmentOperator
src/engine/v5/loop2.ts:324:9
       let zeros = 1; // this occurrence
       for (const rec of state.history.slice(0, RECENCY_WINDOW_SESSIONS)) {
         if (repsScore(rec.sets) != null || rec.sets.length === 0) break;
-        zeros += 1;
+        zeros -= 1;
       }
       if (zeros > attemptsToClearN(state.history, band)) {
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:326:11
         if (repsScore(rec.sets) != null || rec.sets.length === 0) break;
         zeros += 1;
       }
-      if (zeros > attemptsToClearN(state.history, band)) {
+      if (true) {
         return { decision: 'stall_rotate', load: null, band, sets: state.sets, wantsChange: 'rotate' };
       }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall ONE bad day of zeros still just holds — the rotation needs more than her attempts-to-clear
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ambiguous"
Received: "stall_rotate"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:326:11
         if (repsScore(rec.sets) != null || rec.sets.length === 0) break;
         zeros += 1;
       }
-      if (zeros > attemptsToClearN(state.history, band)) {
+      if (zeros <= attemptsToClearN(state.history, band)) {
         return { decision: 'stall_rotate', load: null, band, sets: state.sets, wantsChange: 'rotate' };
       }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: "ambiguous"

[Killed] StringLiteral
src/engine/v5/loop2.ts:327:93
         zeros += 1;
       }
       if (zeros > attemptsToClearN(state.history, band)) {
-        return { decision: 'stall_rotate', load: null, band, sets: state.sets, wantsChange: 'rotate' };
+        return { decision: 'stall_rotate', load: null, band, sets: state.sets, wantsChange: "" };
       }
     }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rotate"
Received: ""

[Killed] StringLiteral
src/engine/v5/loop2.ts:327:28
         zeros += 1;
       }
       if (zeros > attemptsToClearN(state.history, band)) {
-        return { decision: 'stall_rotate', load: null, band, sets: state.sets, wantsChange: 'rotate' };
+        return { decision: "", load: null, band, sets: state.sets, wantsChange: 'rotate' };
       }
     }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall a lift she TRIED and could not do one rep of is rotated away, not held for ever
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "stall_rotate"
Received: ""

[Killed] EqualityOperator
src/engine/v5/loop2.ts:333:39
     return { decision: 'ambiguous', load: null, band, sets: state.sets };
   }
 
-  const allMetThi = sets.every((s) => s.reps >= band.hi); // S-52 trigger 1: too easy
+  const allMetThi = sets.every((s) => s.reps < band.hi); // S-52 trigger 1: too easy
   if (allMetThi) {
     return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall every set reaches Thi → graduate (too easy)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:333:39
     return { decision: 'ambiguous', load: null, band, sets: state.sets };
   }
 
-  const allMetThi = sets.every((s) => s.reps >= band.hi); // S-52 trigger 1: too easy
+  const allMetThi = sets.every((s) => false); // S-52 trigger 1: too easy
   if (allMetThi) {
     return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall every set reaches Thi → graduate (too easy)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:334:7
   }
 
   const allMetThi = sets.every((s) => s.reps >= band.hi); // S-52 trigger 1: too easy
-  if (allMetThi) {
+  if (false) {
     return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
   }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall every set reaches Thi → graduate (too easy)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] BlockStatement
src/engine/v5/loop2.ts:334:18
   }
 
   const allMetThi = sets.every((s) => s.reps >= band.hi); // S-52 trigger 1: too easy
-  if (allMetThi) {
-    return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
-  }
+  if (allMetThi) {}
 
   // Her past scores, oldest-first, inside the recency window (F-8).
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall every set reaches Thi → graduate (too easy)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] StringLiteral
src/engine/v5/loop2.ts:335:85
 
   const allMetThi = sets.every((s) => s.reps >= band.hi); // S-52 trigger 1: too easy
   if (allMetThi) {
-    return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
+    return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: "" };
   }
 
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall every set reaches Thi → graduate (too easy)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: ""

[Survived] MethodExpression
src/engine/v5/loop2.ts:339:16
   }
 
   // Her past scores, oldest-first, inside the recency window (F-8).
-  const past = [...state.history.slice(0, RECENCY_WINDOW_SESSIONS)]
-    .reverse()
+  const past = [...state.history.slice(0, RECENCY_WINDOW_SESSIONS)]
     .map((r) => repsScore(r.sets))
     .filter((s): s is number => s != null);

[Survived] MethodExpression
src/engine/v5/loop2.ts:339:16
   }
 
   // Her past scores, oldest-first, inside the recency window (F-8).
-  const past = [...state.history.slice(0, RECENCY_WINDOW_SESSIONS)]
-    .reverse()
-    .map((r) => repsScore(r.sets))
-    .filter((s): s is number => s != null);
+  const past = [...state.history.slice(0, RECENCY_WINDOW_SESSIONS)].reverse().map(r => repsScore(r.sets));
   let best: number | null = null;
   let trailing = 0; // consecutive most-recent occurrences that failed to improve

[Killed] ArrowFunction
src/engine/v5/loop2.ts:341:10
   // Her past scores, oldest-first, inside the recency window (F-8).
   const past = [...state.history.slice(0, RECENCY_WINDOW_SESSIONS)]
     .reverse()
-    .map((r) => repsScore(r.sets))
+    .map(() => undefined)
     .filter((s): s is number => s != null);
   let best: number | null = null;
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:342:33
   const past = [...state.history.slice(0, RECENCY_WINDOW_SESSIONS)]
     .reverse()
     .map((r) => repsScore(r.sets))
-    .filter((s): s is number => s != null);
+    .filter((s): s is number => s == null);
   let best: number | null = null;
   let trailing = 0; // consecutive most-recent occurrences that failed to improve
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:342:33
   const past = [...state.history.slice(0, RECENCY_WINDOW_SESSIONS)]
     .reverse()
     .map((r) => repsScore(r.sets))
-    .filter((s): s is number => s != null);
+    .filter((s): s is number => false);
   let best: number | null = null;
   let trailing = 0; // consecutive most-recent occurrences that failed to improve
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] BlockStatement
src/engine/v5/loop2.ts:347:25
   let trailing = 0; // consecutive most-recent occurrences that failed to improve
   const runs: number[] = []; // occurrences spent before each improvement — her attempts-to-improve
   let run = 0;
-  for (const s of past) {
-    run += 1;
-    if (best == null || s > best) {
-      runs.push(run);
-      run = 0;
-      best = s;
-      trailing = 0;
-    } else {
-      trailing += 1;
-    }
-  }
+  for (const s of past) {}
   const advanced = best == null || score > best;
   if (advanced) return { decision: 'progress', load: null, band, sets: state.sets };
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Survived] AssignmentOperator
src/engine/v5/loop2.ts:348:5
   const runs: number[] = []; // occurrences spent before each improvement — her attempts-to-improve
   let run = 0;
   for (const s of past) {
-    run += 1;
+    run -= 1;
     if (best == null || s > best) {
       runs.push(run);

[Killed] EqualityOperator
src/engine/v5/loop2.ts:349:25
   let run = 0;
   for (const s of past) {
     run += 1;
-    if (best == null || s > best) {
+    if (best == null || s >= best) {
       runs.push(run);
       run = 0;
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "hold"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:349:9
   let run = 0;
   for (const s of past) {
     run += 1;
-    if (best == null || s > best) {
+    if (best != null || s > best) {
       runs.push(run);
       run = 0;
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "hold"

[Killed] BlockStatement
src/engine/v5/loop2.ts:354:12
       run = 0;
       best = s;
       trailing = 0;
-    } else {
-      trailing += 1;
-    }
+    } else {}
   }
   const advanced = best == null || score > best;
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "hold"

[Killed] AssignmentOperator
src/engine/v5/loop2.ts:355:7
       best = s;
       trailing = 0;
     } else {
-      trailing += 1;
+      trailing -= 1;
     }
   }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "hold"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:358:36
       trailing += 1;
     }
   }
-  const advanced = best == null || score > best;
+  const advanced = best == null || score >= best;
   if (advanced) return { decision: 'progress', load: null, band, sets: state.sets };
 
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:358:20
       trailing += 1;
     }
   }
-  const advanced = best == null || score > best;
+  const advanced = best != null || score > best;
   if (advanced) return { decision: 'progress', load: null, band, sets: state.sets };
 
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:359:7
     }
   }
   const advanced = best == null || score > best;
-  if (advanced) return { decision: 'progress', load: null, band, sets: state.sets };
+  if (false) return { decision: 'progress', load: null, band, sets: state.sets };
 
   // S-52 trigger 2: a stall below Thi — she cannot add reps, and there is no load to add.
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall reps climbing inside the band → progress, no graduation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "progress"
Received: "hold"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:359:7
     }
   }
   const advanced = best == null || score > best;
-  if (advanced) return { decision: 'progress', load: null, band, sets: state.sets };
+  if (true) return { decision: 'progress', load: null, band, sets: state.sets };
 
   // S-52 trigger 2: a stall below Thi — she cannot add reps, and there is no load to add.
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "progress"

[Survived] MethodExpression
src/engine/v5/loop2.ts:362:58
   if (advanced) return { decision: 'progress', load: null, band, sets: state.sets };
 
   // S-52 trigger 2: a stall below Thi — she cannot add reps, and there is no load to add.
-  const N = runs.length === 0 ? ATTEMPTS_TO_CLEAR_SEED : Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
+  const N = runs.length === 0 ? ATTEMPTS_TO_CLEAR_SEED : Math.min(1, percentileNearestRank(runs, N_PERCENTILE));
   const attempts = trailing + 1; // the flat occurrences before this one, plus this one
   if (attempts > N) {

[Survived] ConditionalExpression
src/engine/v5/loop2.ts:362:13
   if (advanced) return { decision: 'progress', load: null, band, sets: state.sets };
 
   // S-52 trigger 2: a stall below Thi — she cannot add reps, and there is no load to add.
-  const N = runs.length === 0 ? ATTEMPTS_TO_CLEAR_SEED : Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
+  const N = true ? ATTEMPTS_TO_CLEAR_SEED : Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
   const attempts = trailing + 1; // the flat occurrences before this one, plus this one
   if (attempts > N) {

[Killed] ArithmeticOperator
src/engine/v5/loop2.ts:363:20
 
   // S-52 trigger 2: a stall below Thi — she cannot add reps, and there is no load to add.
   const N = runs.length === 0 ? ATTEMPTS_TO_CLEAR_SEED : Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
-  const attempts = trailing + 1; // the flat occurrences before this one, plus this one
+  const attempts = trailing - 1; // the flat occurrences before this one, plus this one
   if (attempts > N) {
     return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "hold"

[Killed] EqualityOperator
src/engine/v5/loop2.ts:364:7
   // S-52 trigger 2: a stall below Thi — she cannot add reps, and there is no load to add.
   const N = runs.length === 0 ? ATTEMPTS_TO_CLEAR_SEED : Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
   const attempts = trailing + 1; // the flat occurrences before this one, plus this one
-  if (attempts > N) {
+  if (attempts >= N) {
     return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
   }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall repeating a number is not an advance — a flat occurrence HOLDS (S-32b stays honest)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hold"
Received: "graduate"

[Killed] ConditionalExpression
src/engine/v5/loop2.ts:364:7
   // S-52 trigger 2: a stall below Thi — she cannot add reps, and there is no load to add.
   const N = runs.length === 0 ? ATTEMPTS_TO_CLEAR_SEED : Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
   const attempts = trailing + 1; // the flat occurrences before this one, plus this one
-  if (attempts > N) {
+  if (false) {
     return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
   }
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: "hold"

[Killed] ObjectLiteral
src/engine/v5/loop2.ts:365:12
   const N = runs.length === 0 ? ATTEMPTS_TO_CLEAR_SEED : Math.max(1, percentileNearestRank(runs, N_PERCENTILE));
   const attempts = trailing + 1; // the flat occurrences before this one, plus this one
   if (attempts > N) {
-    return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
+    return {};
   }
   return { decision: 'hold', load: null, band, sets: state.sets };
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall S-52's OWN trap case · a 12-15 athlete stuck FLAT at 3×12 (Tlo met every time) graduates on the stall — never frozen
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "graduate"
Received: undefined

[Killed] StringLiteral
src/engine/v5/loop2.ts:367:22
   if (attempts > N) {
     return { decision: 'graduate', load: null, band, sets: state.sets, wantsChange: 'graduate' };
   }
-  return { decision: 'hold', load: null, band, sets: state.sets };
+  return { decision: "", load: null, band, sets: state.sets };
 }
 
killedBy: S-51/S-52 · bodyweight progresses on reps and graduates at Thi or on a stall repeating a number is not an advance — a flat occurrence HOLDS (S-32b stays honest)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "hold"
Received: ""
