[Killed] BlockStatement
src/engine/v5/loop3.ts:39:62
   decision: VolumeDecision;
 }
 
-export function decideVolume(inp: VolumeInput): VolumeResult {
-  const { sets, minSets, maxSets, completedAll, anyAdvanced, unfinishedStreak } = inp;
-
-  if (completedAll && anyAdvanced) {
-    // S-32: earn a set — unless the time budget is already full (S-64 ceiling).
-    if (sets + 1 > maxSets) return { sets, decision: 'capped' };
-    return { sets: sets + 1, decision: 'progress' };
-  }
-
-  if (completedAll && !anyAdvanced) {
-    // S-32b: completed everything but nothing advanced → hold. The stall belongs to Loop 2.
-    return { sets, decision: 'hold' };
-  }
-
-  // Not completed.
-  if (unfinishedStreak >= 2) {
-    // S-34: cut a set, but never below the floor (S-35).
-    if (sets - 1 < minSets) return { sets: minSets, decision: 'at_floor' }; // S-35/36: assembly acts
-    return { sets: sets - 1, decision: 'cut' };
-  }
-
-  // S-33: first unfinished occurrence → hold.
-  return { sets, decision: 'hold' };
-}
+export function decideVolume(inp: VolumeInput): VolumeResult {}
 
killedBy: S-32 · completed every set AND a lift advanced → +1 set earns a set
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"decision": "progress", "sets": 5}
Received: undefined

[Killed] ConditionalExpression
src/engine/v5/loop3.ts:42:7
 export function decideVolume(inp: VolumeInput): VolumeResult {
   const { sets, minSets, maxSets, completedAll, anyAdvanced, unfinishedStreak } = inp;
 
-  if (completedAll && anyAdvanced) {
+  if (true) {
     // S-32: earn a set — unless the time budget is already full (S-64 ceiling).
     if (sets + 1 > maxSets) return { sets, decision: 'capped' };
killedBy: S-32b · completed everything but nothing advanced → hold (more volume for a stall is theory) holds
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "decision": "hold",
-   "sets": 4,

[Killed] ConditionalExpression
src/engine/v5/loop3.ts:42:7
 export function decideVolume(inp: VolumeInput): VolumeResult {
   const { sets, minSets, maxSets, completedAll, anyAdvanced, unfinishedStreak } = inp;
 
-  if (completedAll && anyAdvanced) {
+  if (false) {
     // S-32: earn a set — unless the time budget is already full (S-64 ceiling).
     if (sets + 1 > maxSets) return { sets, decision: 'capped' };
killedBy: S-32 · completed every set AND a lift advanced → +1 set earns a set
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "decision": "progress",
-   "sets": 5,

[Killed] EqualityOperator
src/engine/v5/loop3.ts:44:9
 
   if (completedAll && anyAdvanced) {
     // S-32: earn a set — unless the time budget is already full (S-64 ceiling).
-    if (sets + 1 > maxSets) return { sets, decision: 'capped' };
+    if (sets + 1 >= maxSets) return { sets, decision: 'capped' };
     return { sets: sets + 1, decision: 'progress' };
   }
killedBy: Stage 7 · v5 produces the Weekly Update the screens render S-45 · a Loop 3 VOLUME grow is narrated in the mirror ("added a set")
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/engine/v5/loop3.ts:44:9
 
   if (completedAll && anyAdvanced) {
     // S-32: earn a set — unless the time budget is already full (S-64 ceiling).
-    if (sets + 1 > maxSets) return { sets, decision: 'capped' };
+    if (sets - 1 > maxSets) return { sets, decision: 'capped' };
     return { sets: sets + 1, decision: 'progress' };
   }
killedBy: S-32 · completed every set AND a lift advanced → +1 set but not past the time-budget ceiling (S-64) → capped, not grown
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "decision": "capped",
-   "sets": 8,

[Killed] ArithmeticOperator
src/engine/v5/loop3.ts:45:20
   if (completedAll && anyAdvanced) {
     // S-32: earn a set — unless the time budget is already full (S-64 ceiling).
     if (sets + 1 > maxSets) return { sets, decision: 'capped' };
-    return { sets: sets + 1, decision: 'progress' };
+    return { sets: sets - 1, decision: 'progress' };
   }
 
killedBy: Stage 7 · v5 produces the Weekly Update the screens render S-45 · a Loop 3 VOLUME grow is narrated in the mirror ("added a set")
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/engine/v5/loop3.ts:45:40
   if (completedAll && anyAdvanced) {
     // S-32: earn a set — unless the time budget is already full (S-64 ceiling).
     if (sets + 1 > maxSets) return { sets, decision: 'capped' };
-    return { sets: sets + 1, decision: 'progress' };
+    return { sets: sets + 1, decision: "" };
   }
 
killedBy: S-32 · completed every set AND a lift advanced → +1 set earns a set
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "decision": "progress",
+   "decision": "",

[Killed] ConditionalExpression
src/engine/v5/loop3.ts:48:7
     return { sets: sets + 1, decision: 'progress' };
   }
 
-  if (completedAll && !anyAdvanced) {
+  if (true) {
     // S-32b: completed everything but nothing advanced → hold. The stall belongs to Loop 2.
     return { sets, decision: 'hold' };
killedBy: S-33 / S-34 · unfinished holds once, cuts on the second in a row unfinished twice → −1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "decision": "cut",
-   "sets": 3,

[Survived] LogicalOperator
src/engine/v5/loop3.ts:48:7
     return { sets: sets + 1, decision: 'progress' };
   }
 
-  if (completedAll && !anyAdvanced) {
+  if (completedAll || !anyAdvanced) {
     // S-32b: completed everything but nothing advanced → hold. The stall belongs to Loop 2.
     return { sets, decision: 'hold' };

[Killed] ConditionalExpression
src/engine/v5/loop3.ts:54:7
   }
 
   // Not completed.
-  if (unfinishedStreak >= 2) {
+  if (false) {
     // S-34: cut a set, but never below the floor (S-35).
     if (sets - 1 < minSets) return { sets: minSets, decision: 'at_floor' }; // S-35/36: assembly acts
killedBy: D · Loop 3 — the learned per-muscle set target moves on facts S-34 · unfinished twice in a row → −1 set (a first unfinished only holds)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] EqualityOperator
src/engine/v5/loop3.ts:54:7
   }
 
   // Not completed.
-  if (unfinishedStreak >= 2) {
+  if (unfinishedStreak > 2) {
     // S-34: cut a set, but never below the floor (S-35).
     if (sets - 1 < minSets) return { sets: minSets, decision: 'at_floor' }; // S-35/36: assembly acts
killedBy: S-33 / S-34 · unfinished holds once, cuts on the second in a row unfinished twice → −1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "decision": "cut",
-   "sets": 3,

[Killed] ConditionalExpression
src/engine/v5/loop3.ts:56:9
   // Not completed.
   if (unfinishedStreak >= 2) {
     // S-34: cut a set, but never below the floor (S-35).
-    if (sets - 1 < minSets) return { sets: minSets, decision: 'at_floor' }; // S-35/36: assembly acts
+    if (true) return { sets: minSets, decision: 'at_floor' }; // S-35/36: assembly acts
     return { sets: sets - 1, decision: 'cut' };
   }
killedBy: S-33 / S-34 · unfinished holds once, cuts on the second in a row unfinished twice → −1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "decision": "cut",
+   "decision": "at_floor",

[Killed] EqualityOperator
src/engine/v5/loop3.ts:56:9
   // Not completed.
   if (unfinishedStreak >= 2) {
     // S-34: cut a set, but never below the floor (S-35).
-    if (sets - 1 < minSets) return { sets: minSets, decision: 'at_floor' }; // S-35/36: assembly acts
+    if (sets - 1 >= minSets) return { sets: minSets, decision: 'at_floor' }; // S-35/36: assembly acts
     return { sets: sets - 1, decision: 'cut' };
   }
killedBy: S-33 / S-34 · unfinished holds once, cuts on the second in a row unfinished twice → −1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "decision": "cut",
+   "decision": "at_floor",

[Killed] ArithmeticOperator
src/engine/v5/loop3.ts:57:20
   if (unfinishedStreak >= 2) {
     // S-34: cut a set, but never below the floor (S-35).
     if (sets - 1 < minSets) return { sets: minSets, decision: 'at_floor' }; // S-35/36: assembly acts
-    return { sets: sets - 1, decision: 'cut' };
+    return { sets: sets + 1, decision: 'cut' };
   }
 
killedBy: S-33 / S-34 · unfinished holds once, cuts on the second in a row unfinished twice → −1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "decision": "cut",
-   "sets": 3,
